In [1]:
import pandas as pd

In [26]:
mydataset={ 
    'cars': ["BMW", "Volvo", "Ford"], 
    'Passings': [3, 7, 2]
}

In [23]:
my_var=pd.DataFrame(mydataset)
print(my_var)

    cars  Passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [28]:
my_var

    cars  Passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [40]:
my_var['cars']

0      BMW
1    Volvo
2     Ford
Name: cars, dtype: object

In [48]:
my_var.iloc[:1]

  cars  Passings
0  BMW         3

In [50]:
data=[10, 20, 30, 40, 50]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [52]:
series = pd.array(data)
print(series)

<IntegerArray>
[10, 20, 30, 40, 50]
Length: 5, dtype: Int64

In [54]:
print(series[0])

10

In [56]:
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [58]:
print(series[3])

40

In [60]:
data=['a', 2, 4, 'b', 'c']
series=pd.Series(data)
print(series)

0    a
1    2
2    4
3    b
4    c
dtype: object

In [62]:
array_rep = series.values
print(array_rep)

['a' 2 4 'b' 'c']

In [ ]:
data = [10, 20, 30, 40, 50]
series = pd.Series(data)
print("series represenation:\n", series)